# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P2/4
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1],0],  # 0
  
   [-1, 1, Conv, [64, 3, 2],0],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1],0],
   
   [-1, 1, Conv, [128, 3, 2],0],  # 3-P2/4


   #Elan  
   [-1, 1, Conv, [64, 1, 1],0],
   [-2, 1, Conv, [64, 1, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [[-1, -3, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [256, 1, 1],0],  # 11
   

   #MP1      
   [-1, 1, MP, [],0],
   [-1, 1, Conv, [128, 1, 1],0],
   [-3, 1, Conv, [128, 1, 1],0],
   [-1, 1, Conv, [128, 3, 2],0],
   [[-1, -3], 1, Concat, [1],0],  # 16-P3/8  

   #Elan
   [-1, 1, Conv, [128, 1, 1],0],
   [-2, 1, Conv, [128, 1, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [[-1, -3, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [512, 1, 1],0],  # 24
         

   #MP1
   [-1, 1, MP, [],0],
   [-1, 1, Conv, [256, 1, 1],0],
   [-3, 1, Conv, [256, 1, 1],0],
   [-1, 1, Conv, [256, 3, 2],0],
   [[-1, -3], 1, Concat, [1],0],  # 29-P4/16  
   

   #Elan
   [-1, 1, Conv, [256, 1, 1],0],
   [-2, 1, Conv, [256, 1, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [[-1, -3, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [1024, 1, 1],0],  # 37
   

   #MP1      
   [-1, 1, MP, [],0],
   [-1, 1, Conv, [512, 1, 1],0],
   [-3, 1, Conv, [512, 1, 1],0],
   [-1, 1, Conv, [512, 3, 2],0],
   [[-1, -3], 1, Concat, [1],0],  # 42-P5/32  
   

   #Elan
   [-1, 1, Conv, [256, 1, 1],0],
   [-2, 1, Conv, [256, 1, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [[-1, -3, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [1024, 1, 1],0],  # 50
  ]

# yolov7 head
head:
  [
    [-1, 1, SELayer,[1024],2],
  [-1, 1, SPPCSPC, [512],0], # 52
  
  #upsample + concat
   [-1, 1, Conv, [256, 1, 1],0],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'],0],
   [37, 1, Conv, [256, 1, 1],0], # route backbone P4
   [-1, 1, SELayer,[256],2],
   [[-1, -3], 1, Concat, [1],1],
   

   #ElanH
   [-1, 1, Conv, [256, 1, 1],0],
   [-2, 1, Conv, [256, 1, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [256, 1, 1],0], # 65
   

   #upsample + concat
   [-1, 1, Conv, [128, 1, 1],0],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'],0],
   [24, 1, Conv, [128, 1, 1],0], # route backbone P3
   [-1, 1, SELayer,[128],2],
   [[-1, -3], 1, Concat, [1],1],
   
   #ElanH
   [-1, 1, Conv, [128, 1, 1],0],
   [-2, 1, Conv, [128, 1, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [-1, 1, Conv, [64, 3, 1],0],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [128, 1, 1],0], # 78
   



   #add
    #upsample + concat
   [-1, 1, Conv, [64, 1, 1],2],
   [-1, 1, nn.Upsample, [None, 2, 'nearest'],2],
   [11, 1, Conv, [64, 1, 1],2], # route backbone P2
   [-1, 1, SELayer,[64],2],
   [[-1, -3], 1, Concat, [1],2],
   
   #add ElanH
   [-1, 1, Conv, [64, 1, 1],2],
   [-2, 1, Conv, [64, 1, 1],2],
   [-1, 1, Conv, [32, 3, 1],2],
   [-1, 1, Conv, [32, 3, 1],2],
   [-1, 1, Conv, [32, 3, 1],2],
   [-1, 1, Conv, [32, 3, 1],2],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1],2],
   [-1, 1, Conv, [64, 1, 1],2], # 91
   


   #add MP2 + concat   
   [-1, 1, MP, [],2],
   [-1, 1, Conv, [64, 1, 1],2],
   [-3, 1, Conv, [64, 1, 1],2],
   [-1, 1, Conv, [64, 3, 2],2],
   [[-1, -3, 78], 1, Concat, [1],2],

   #add ElanH
   [-1, 1, Conv, [128, 1, 1],2],
   [-2, 1, Conv, [128, 1, 1],2],
   [-1, 1, Conv, [64, 3, 1],2],
   [-1, 1, Conv, [64, 3, 1],2],
   [-1, 1, Conv, [64, 3, 1],2],
   [-1, 1, Conv, [64, 3, 1],2],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1],2],
   [-1, 1, Conv, [128, 1, 1],2], # 104




   #MP2 + concat   
   [-1, 1, MP, [],0],
   [-1, 1, Conv, [128, 1, 1],0],
   [-3, 1, Conv, [128, 1, 1],0],
   [-1, 1, Conv, [128, 3, 2],0],
   [[-1, -3, 65], 1, Concat, [1],0],
   
   #ElanH
   [-1, 1, Conv, [256, 1, 1],0],
   [-2, 1, Conv, [256, 1, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [-1, 1, Conv, [128, 3, 1],0],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [256, 1, 1],0], # 117
  
    #MP2 + concat
   [-1, 1, MP, [],0],
   [-1, 1, Conv, [256, 1, 1],0],
   [-3, 1, Conv, [256, 1, 1],0],
   [-1, 1, Conv, [256, 3, 2],0],
   [[-1, -3, 52], 1, Concat, [1],0],
   
   #ElanH
   [-1, 1, Conv, [512, 1, 1],0],
   [-2, 1, Conv, [512, 1, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [-1, 1, Conv, [256, 3, 1],0],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1],0],
   [-1, 1, Conv, [512, 1, 1],0], # 130
   
   #[75, 1, RepConv, [256, 3, 1]],
   #[88, 1, RepConv, [512, 3, 1]],
   #[101, 1, RepConv, [1024, 3, 1]],

   #change
   [91, 1, RepConv, [128, 3, 1],2],
   [104, 1, RepConv, [256, 3, 1],0],
   [117, 1, RepConv, [512, 3, 1],0],
   [130, 1, RepConv, [1024, 3, 1],0],

   [[131,132,133,134], 1, IDetect, [nc, anchors],0],   # Detect(P2,P3, P4, P5)
  ]
